    // 1. Сделать собственные примеры методов применяемых для массивов.

    //join:

let arr = ['block', 'style', 'background'];

let block = arr.join('.')
console.log(block);
    
    // concat:
    let arr2 = ['width', 'height', 'color', 'border'];
let arrNew = arr.concat(arr2);
console.log(arrNew);

    // 3. Определить элементы массива и вывести их значения, индексы которых лежит в указанном пределе. Предел вводит пользователь.

    // 4. Отсортировать массив на 10 чисел в порядке возростания. Значения принимаются от пользователя. Сортировка осушествляется методом sort().
    
    // 5. Создать программу, выполняющую вставку элемента в массив после элемента, значение которого укажет пользователь.

    // 6. Необходимо получить предпоследний элемент из массива month и вывести его на экран.
    // var month = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"] - 3 способами

    